{
    "comments": [
        "The amount of time humanity has wasted on this discussion is beyond insane.",
        "As a woman who’s struggling to conceive, thank you Matt Walsh",
        "As someone who struggled with infertility for 10 years, when trans people question my womanhood or compare me to them, it makes my blood boil. Thank you, Matt for shutting down that argument and educating him.",
        "I’m a 22 year old women and I’m so tired of people calling me a CIS WOMEN. I AM A WOMEN. Stop calling normal people Cis. It’s crazy that there’s even a word for people that aren’t trans",
        "This honestly makes Matt Walsh look so smart. But in reality he's just being normal/reasonable. Like this is what in  2001 nobody would question",
        "It is ABSOLUTELY ridiculous that we as a civilization have arrived to the point that a conference has to be held to explain this.",
        "The look on HIS face when he was forced to admit he didn't think a man could have a miscarriage was priceless",
        "“No doctor on earth is gonna run tests to see what’s wrong with it!” The laugh of the audience explained it all.",
        "The fact that this person can be an EMT is scary",
        "Trying to win an argument against Matt Walsh is as impossible as trying to find a unicorn in field of sunflowers.",
        "God save this man he is speaking facts",
        "How the hell did we get so far as to have to re-educate a whole generation about what is a woman?",
        "Imagine using REAL women with infertility issues as your shield as to why men can be women… THE AUDACITY",
        "My mother almost lost her life giving birth to me, she almost paid the highest price to have me because she was born a woman, that’s a real woman, and that’s something a dude dressed as a girl will never be able to do. The fact that that there are dudes calling themselves actual women is beyond disrespectful. Be gay it’s okay, take it up whatever whole you want, dress however you like, but never call yourself a woman, you’ll never be close to being one.",
        " I loved the “human legs” example to counter the illogical argument. The “trans” went into a complete meltdown",
        "It’s utterly ridiculous how we’re even having debates about something so simple and straightforward as sex and biology in the 21st century. Keep up the good work, Matt. Don’t stop fighting against this lunacy",
        "I'm actually happy to see a person who disagreed actually willing to give it a chance at having a conversation. Usually these people just scream and throw a fit, until the university or whatever gets rid of Matt. \n\nSo this individual, even though they're totally wrong, still deserves to be acknowledged for at least trying",
        "The fact that we have to even discuss this is beyond belief.",
        "Matt has the easiest job in the world, explaining pre-school biology to grown adults over, and over, and over again.",
        "We need more people like him to save this world from horrible “spectrum of gender” shit",
        "It’s astonishing that we’ve reached a point where we need to explain things that 2 and 3 graders already know. Like men can’t get pregnant.\nShows us what stupid times we live. Good for those who still stand up for objective truth and also good for those who believe otherwise, but are willing to engage in honest conversations.",
        "Imagine being a woman who fought for human rights and then in the 2020s you hear people asking \"What is a Woman?\"",
        "The way Matt goes about it makes the entirety of life easier to understand because I’ve been seriously confused and this simplicity makes it clear that I’ve been gaslighted into believing things that doesn’t exist and making myself believe them forcefully",
        "I love how he just walks away in defeat after Matt absolutely destroys his argument.",
        "He actually made a great argument on why not to waste your money on college",
        "It's nice to have a real man defend real women. Maybe defend is the wrong word but he's telling these deluded individuals how it is minus any sugar coating ",
        "Bravo! We need everyone with any form of intelligence to come forward and shut this madness down once and for all.",
        "Gotta love how he immediately left knowing he just got schooled and everyone in the crowd just laughed at them for being so idiotic",
        "I’m so glad that someone is speaking the truth.",
        "Good job Matt! Very good debate! You always win  And when you win, we all win!",
        "Hard to believe we actually have to have theses debates. God bless you Matt!",
        "I love you Matt. Thank you for explaining this in the simplest form for these simple minded individuals.",
        "I absolutely love what Matt Walsh does!",
        "Anyone who thinks like this has no business being an EMT, you could arrive to a scene where the victim is unconscious and the hospital is calling you to get some details on the incoming patient, they ask you if it's a man or a woman and you respond \"I don't know, they're not awake to tell me!\" ️️️",
        "It's amazing, and I'm being nice, that Matt Walsh has to explain these things to anyone on Earth.",
        "Thank you matt for standing against insanity",
        "As a student of biology I still am yet to come across any kind of study that proves sex is a spectrum.",
        "all feelings aside, good on that person for engaging. it is really hard to stand up in a room of people who (seemingly) don't agree with you and participate in a debate without resorting to name calling or childishness. Love to see good open debate regardless of opinion!",
        "It is absolutely absurd that this argument even has to be made",
        "Imagine you have to explain high school biology to someone who claims to have studied more \"complex\" biology. His face at the end was priceless though ",
        "In fairness, though delusional in other matters, when it came down to a life or death scenario the 'trans' EMT was professional and honest enough to admit the truth. Considering the flack he will probably get for recognising a basic biological fact as being a fact - and he must know the abuse that will be coming - that took considerable moral and physical courage. ",
        "I love how tons of trans people pull out the “well maybe I’m intersex, many of us are intersex so you just don’t know” when in reality %0.0018 of the population is intersex",
        "The two leg analogy was probably the best response to the “spectrum” argument I’ve heard yet. Really, very well said. I love it",
        "Cannot believe we need Matt so much… to explain matters so simple…to these people",
        "Hats off to Matt Walsh, he is able to keep his calm whilst dealing with the delusional",
        "That's Matt Walsh, spitting facts and taking his show on the road",
        "I love when people say gender is non-binary and identify as such, but they still choose to express themselves within that very same binary.\n\nWrap your heads around that.",
        "I came from a woman, then I came in a woman, and made a new woman.  That's my story and I'm sticking to it ",
        "I find it admirable that they challenge Matt knowing they're about to get embarrassed in front of thousands.",
        "The fact that Matt has to explain all this is beyond belief. You would think it’s basic common sense…",
        "É muito tempo perdido pra explicar que 1 + 1 = 2. Uma pena que o mundo todo tá caminhando para uma falta de raciocínio lógico em prol da ignorância e da relativização geral de tudo. Vídeo fantástico.",
        "If \"HIS\" logic about his own gender is so messed up I will never put any human life in his hand ..how he is allowed to work as an EMT..",
        "Lol, I loved his face when Matt hit him with that question. Loved it",
        "The fact this conversation needs to even happen is just insane.",
        "I love this guy and he always speaks with logic.",
        "We need to protect this man, he telling the truth in all spectrums…",
        "I like listening to you Matt; youve actually helped me cope through my experience. And I shit you not, I lost my family due to feminism. \n\nI truly hope youre as genuine as I think. We need more men to think like you.",
        "One of the best explanations ever by Dr. Walsh.",
        "I'm completely over these people trying to force others to participate in their role playing. The tipping point for me was when I found about the \"gender affirming care for minors\". That's just evil and anyone saying otherwise is mentally or morally deficient.",
        "At no point when I was growing up, did I think I would ever experience society having to question what a man was or what a woman was.",
        "You nailed it Mr. Walsh",
        "Man, this is one of the most satisfying debates I have ever watched. I have watched it several times and I still can’t get enough of it ! If you don’t agree with Walsh here, it’s only because you are NOT interested in the truth.",
        "Every human being should watch this clip.",
        "This is one of the best descriptions I've heard -- women, by nature, can get pregnant.  The comparison to \"legs\" is perfect.  Great job Matt.",
        "I love it, his inability to answer Matt's question! His silence was defining!",
        "The fact Matt can keep a straight face and still show these people respect really says a lot about his character. God Bless you, Matt!",
        "Although I strongly disagree with its arguments, delusions, and ideology, I give it the upmost respect for just being able to get up in front of a whole crowd of people laughing at it. That truly takes bravery. I also thank it for its service as an EMT.",
        "Well said  and THAT is the truth right there",
        "Nice and simple analogy, sir. Thank you for this discussion. ",
        "This is undoubtedly one of the best arguments I've ever heard on this subject",
        "Couldnt have said it better myself well said ",
        "THANK YOU MATT. As a woman who is struggling to get pregnant this man questioning Matt made my blood boil\n Well freaking said sir!",
        "matt was so kind. the emt guy was happy he broke it down like that.",
        "Love him, great male human being",
        "I know debate is important but why would someone choose to humiliate themselves like that!",
        "God bless you Matt Walsh, world needs this humanity!",
        "It is so insane that this has to be explained to an adult",
        "Mannnn I love this guy. We need this because this gender fluid crap is getting out of hand . The problem is we stopped the bullying and let them be free but they got too free and start talking craziness",
        "The woman screaming in the background just makes this ten times better, children can answer ‘what is a woman?’ So easily, but older ones have turned it into the most difficult question ever, what has the world come to?",
        "As incredible as he is giving the explanation that destroyed the dude, he is probably still in the state of confusion.",
        "Wonderfully said\nIt blows my mind that we have to even have debates like this.\n#Praying4Humanity",
        "They argue for arguments sake. It’s absolutely insane.",
        "My heart breaks for these people \nI don’t hate people who identify as transgender at all. I do feel a lot of hurt for them, though. I pray people’s eyes will start to open up to what is so simple.",
        "Believe it or not, people think Matt Walsh lost this debate. No, seriously… they actually exist.",
        "I have massive respect for Matt to engage in a debate with these people n teach them basic things like why do u feel the need to complicate simple things",
        "This shocks me so much that this is a conversation to be had to people.",
        "If somebody pauses and says \"look\" or \"it's complicated\", then they've already lost the argument.",
        "For one second, that guy saw hope winning a debate over Matt. Then Matt destroyed him completely once again ",
        "Wow, one word\nRespect for this guy",
        "Im so sick of this seriously. Thank you Matt for going strong for us women",
        "I applaud Matt for stooping so low to these people's reasoning level. It must have been so brainwrecking trying to engage people with mental issues in that simple dialogue.",
        "Amazing explanation, and Jesus Christ the fact we are having this conversation makes me want to get off this ride and go live in the woods off the grid.",
        "It is ridiculous how we all feel satisfied with the way he explains things in a discussion that should not be brought up in the first place :/",
        "He definitely went to cry in his car after getting roasted ",
        "Protect this man, he’s one of the few actually trying to help the human race back on the right track",
        "My heart breaks a little bit for the person he's talking to. Think what you like but they're still a human being and they look crushed when they hear the facts presented to them.",
        "I couldn't win a debate against Matt Walsh to save my life! ",
        "Keep speaking up to the simple truth people! This nonsense prevailed because we stayed silent for long",
        "The reason why the question \"What is a woman\" is so controversial and highly debated is because it is one of the most personal questions you can ask someone. \n\nThis is due to the fact the most people see themselves as either male or female, or being a man or woman. When someone does ask this question it is easy for us to take it personally. This is why we get so defensive. "
    ]
}